Revit 2026 API

# IFCFileCreateInstance Method

---

Creates an IFC instance in the file model.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCAnyHandle CreateInstance(
	string name
)
```
```vb
Public Function CreateInstance (
	name As String
) As IFCAnyHandle
```
```cpp
public:
IFCAnyHandle^ CreateInstance(
	String^ name
)
```
```fsharp
member CreateInstance :
        name : string -> IFCAnyHandle
```

#### Parameters

name String
     The instance name.

#### Return Value

IFCAnyHandle The instance handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCFile Class

Autodesk.Revit.DB.IFC Namespace